In [1]:

# import libraries
from sqlalchemy import create_engine, text
from dotenv  import load_dotenv
import os
import pandas as pd

In [6]:
 # loading my credentials
load_dotenv(override=True)

True

In [7]:
# credentials
host = os.getenv('db_host')
username = os.getenv('db_username')
password = os.getenv('db_password')
port = os.getenv('db_port')
db_name = os.getenv('db_name')

In [8]:
## create an engine
database_url = f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{db_name}"
engine = create_engine(database_url)

In [10]:
print(database_url)

postgresql+psycopg2://postgres:Aveb6740@localhost:5432/DB_students

In [17]:
# creating a connection and Table 

sql_query = ''' 
                CREATE TABLE students(
                name text,
                address varchar, 
                class varchar, 
                age int
             )          


            '''
with engine.connect() as connection:
    connection.execute(text(sql_query))
    connection.commit()

    print('TABLE CREATED SUCCESSFULLY!')

TABLE CREATED SUCCESSFULLY!

In [25]:
### Alter the schema of the table
sql_query = ''' 
                ALTER Table students Alter column age type varchar(10)
                      


            '''
with engine.connect() as connection:
    connection.execute(text(sql_query))
    connection.commit()

    
    
    
print('TABLE CREATED SUCCESSFULLY!')

TABLE CREATED SUCCESSFULLY!

In [26]:
## Insert one row of data into the table
sql_query = ''' 
                insert into  students(name, address, class, age) 
                values(:name, :address, :class, :age)
                 '''
data = {'name': 'Remi', 'address': '13 railway street Agai', 'class':'300Level', 'age': '50'}
with engine.connect() as connection:
    connection.execute(text(sql_query), data)
    connection.commit()

print('one row of data successfully inserted')

one row of data successfully inserted

In [33]:
### Insert multiple rows of Data into the table

sql_query = ''' 
                insert into  students(name, address, class, age) 
                values(:name, :address, :class, :age)
                 '''
data = [{'name': 'Jemi', 'address': '913 Utaako street jos', 'class':'200Level', 'age': '3'}, 
{'name': 'Josh', 'address': '53 Dereso street florida', 'class':'400Level', 'age': '10'},
{'name': 'Yemisi', 'address': '88 PasI street eket', 'class':'800Level', 'age': '28'},
{'name': 'Cemiro', 'address': '38 Toba street masaka', 'class':'500Level', 'age': '8'},
{'name': 'Lemiel', 'address': '15 Aiso street minna', 'class':'600Level', 'age': '6'},
{'name': 'Jeremaiah', 'address': '813 Muaso street oso', 'class':'200Level', 'age': '5'},
{'name': 'Nimi', 'address': '153 Wazobia street aba', 'class':'700Level', 'age': '1'}]

with engine.connect() as connection:
    connection.execute(text(sql_query), data)
    connection.commit()

print('multiple row of data successfully inserted')

multiple row of data successfully inserted

In [ ]:
## Delete data from the Table